//*********************************************************************************************************
//*********************************************************************************************************
//*********************************************************************************************************


/*

Проект домашнього завдання ->
1 - три світлодіода, яскравість який контролюється за допомогою ШІМ
2 - сквадність ШІМ регулюємо за допомогою потенціометра
3 - кнопка для перемикання між світлодіолами (по колу)

  *
  5 - живлення світлодіодів згладити конденсатором
  6 - чоерез АЦП заміряти напругу на кожному світлодіоді та їх відображення

*/



/*
фактичний діапазон вимірювання потенціометра складає приблтзно
voltage  -> 0.9 - 1.8
potvalue -> 2000 - 4100 (значення мінімума та максимума періодтчно мкакають тому взято з невелтким запасом)

*/

//*********************************************************************************************************
#include <Arduino.h>

//_________________________________________________________________________________________________________
/*                  створення дефайнів для керування світлододдами
- призначкння піна під світлодіод
- створення каналу, щоб керувати гими окремо
- створення дефайнів з частотою та лмскритизацією сквадності ШІМ (8 біт -> від 0 до 255)
*/ 
#define LED_GREEN 4 
#define LED_RED 6
#define LED_BLUE 5

#define CH1 0
#define CH2 1
#define CH3 2

#define FREQ 5000
#define RESOL 8

//_________________________________________________________________________________________________________
//                      створення дефайнів для ADC з потенціометром
#define PINPOTENC 1   // пін ADC
#define POTRANGE_MAX 4095 // максимальне значення потенціометра
#define POTRANGE_MIN 2000  // мінамальне значення(потрібно буде щоб підняти нуль)
#define POT_VOLTAGE_MAX 1.8// максимальне знаенння напруги на ADC (про всяк випадок)

#define FLOATZERO 5 // плаваючий ноль при розрахунках
#define CUCLE 25  // кількіість ітерацій виміру ADC для середнього значення


//_________________________________________________________________________________________________________
//                      створення дефайнів для кнопки 
#define BUTTON 2
#define MISTKLICK 50



//_________________________________________________________________________________________________________
//                      створення дефайнів для виміру напруги через adc
#define VOLTAGE_SENS_1 15
#define VOLTAGE_SENS_2 16
#define VOLTAGE_SENS_3 17


//*********************************************************************************************************
/*
Ініціюємо функції для простого керування яскравістю світлодіода де ми задаємо лише скважність, а канал та
колір вже сзлвані за лагіко самої функції
*/
void LedGreen (int);
void LedRed (int);
void LedBlue (int);

//_________________________________________________________________________________________________________
// ініціюємо функцію виміру значень потенціометра та приведення їх до значень бітності PWM
int PotControl (void);


bool flag = false;
int MARKER = 1;


void IRAM_ATTR ButtonPress(){
  flag = true;
}


//*********************************************************************************************************
void setup() {

  //_________________________________________________________________________________________________________
  /*
  Ініціюємо аіни по керуванню черех спеціальгий драйвер PWM 
  *ESP32 немає окремих ліній тактування, як для PWM так і для ADC, натомість ж модуль який займається 
   реалізацією цих функцій. Тому ми присвоюємо йому піни якими він буде керувати і тим самим "забеераємо GPIO"
   керування цими пінами в мікроконтроллера
  - задаємо налаштування PWM де вказуємо канал, частоту на якій він тактується та розштрення
  - присвоюємо піну канал з вище вказаними параметрами
  */
  ledcSetup(CH1,FREQ,RESOL);
  ledcSetup(CH2,FREQ,RESOL);
  ledcSetup(CH3,FREQ,RESOL);

  ledcAttachPin(LED_GREEN,CH1);
  ledcAttachPin(LED_BLUE,CH2);
  ledcAttachPin(LED_RED,CH3);

  //_________________________________________________________________________________________________________
  // налаштовуємо передачу по com потру
  Serial.begin(115200);

  //_________________________________________________________________________________________________________
  // налагтовужмо ADC пін

  analogReadResolution(12); // виставляжмо розширення ADC 0-4095 
  // виставляємо атенюатор ADC на 6db, це дозволить працювати з лініжю 1.8 вольта на максимальному діапазоні ADC
  //analogSetAttenuation(ADC_6db); 
  // встановлення атенюатора на конкретному піні
  analogSetPinAttenuation(PINPOTENC,ADC_6db);


  // встановлення значення атенюатора для пінів виміру напруги до 3.3 вольт
  analogSetPinAttenuation(VOLTAGE_SENS_1, ADC_11db);
  analogSetPinAttenuation(VOLTAGE_SENS_2, ADC_11db);
  analogSetPinAttenuation(VOLTAGE_SENS_3, ADC_11db);

  pinMode(BUTTON,INPUT);
  attachInterrupt(digitalPinToInterrupt(BUTTON), ButtonPress, FALLING);

}



 
// змінні для зберігання значень напруги 
float milivotl = 0;
float voltage = 0;

// змінні для зберігання прапорців для затримки на кнорці
bool first = false;
bool second = false;
//*********************************************************************************************************
void loop() {
  //Serial.printf("\n Маркер == ");
  //Serial.print(MARKER);
  //Serial.printf("\n");
  //delay(500);

  //_________________________________________________________________________________________________________
  
  milivotl = analogReadMilliVolts(VOLTAGE_SENS_2);
  voltage = milivotl / 1000;
  // вивід значень напруги LED_RED або в термінал абл в teleplot
  Serial.print(">Voltage_red:");
  Serial.println(voltage);
  //Serial.printf("\nRED-> ");
  //Serial.print(voltage);


  milivotl = analogReadMilliVolts(VOLTAGE_SENS_1);
  voltage = milivotl / 1000;
  // вивід значень напруги LED_GREEN або в термінал або в teleplot
  Serial.print(">Voltage_green:");
  Serial.println(voltage);
  //Serial.printf(" ____GREEN-> ");
  //Serial.print(voltage);


  milivotl = analogReadMilliVolts(VOLTAGE_SENS_3);
  voltage = milivotl / 1000;
  // вивід значень напруги LED_BLUE або в термінал абл в teleplot
  Serial.print(">Voltage_blue:");
  Serial.println(voltage);
  //Serial.printf("_____BLUE-> ");
  //Serial.print(voltage);


  //_________________________________________________________________________________________________________
  // перевірка переривання на кнопці та реалізація затримки від хибного спрацювання
  if(flag == true){
    Serial.printf("\n if прапру");
    flag = false;

    first = digitalRead(BUTTON); // значення відразу після маркера
    delay(MISTKLICK);  // час затримки для перевірки зибного натиску
    second = digitalRead(BUTTON); // значення після затримки

    if(first == second){  
      MARKER++;
      Serial.printf("\n if маркеру");
    }

  }


  //_________________________________________________________________________________________________________
  // вибір контролюємого леда та встановлення значення скважності його ШІМ
  switch (MARKER)
  {
  case 1:
    /* code */
    LedBlue(PotControl());
    break;
  case 2:
    LedGreen(PotControl());
    break;
  case 3:
    LedRed(PotControl());
    break;
  default:
    MARKER = 1;
    break;
  }

}







//*********************************************************************************************************

void LedGreen (int resol){
  ledcWrite(CH1, resol);
}


void LedBlue(int resol){
  ledcWrite(CH2, resol);
}


void LedRed(int resol){
  ledcWrite(CH3, resol);
}


int PotControl(void){

int led_range_coef = (POTRANGE_MAX - POTRANGE_MIN) / 255 ; // коеціцієнт для PWM

  int potvalue = 0; // зміння для запису значень з потенціометра
  int pottrue = 0; // зміння для запису середнього значення з потенціометра
  
  // цикл для отримання серелнього значення з потенціометра
  for (int i = 0; i<CUCLE; i++){

    potvalue = analogRead(PINPOTENC);
    pottrue = pottrue + potvalue;
  }

  pottrue = pottrue/CUCLE; // безпосередньо отримання середнього значення

  //конвертація середнього значення до діапащону PWM
  int potval_led = ((pottrue - POTRANGE_MIN) / led_range_coef)-FLOATZERO;

  // test row
  //Serial.print(potval_led);

  return potval_led;

}