/*
Так як з електрожвигуном в мене були просадки по напрузі на платі жвлення, було прийняте ріщення прямого заміру перемикання реле
На центральний контакт реле подається 3.3 вольта а з двох крайніх знімається логічна 1 та 0 через переривання
це дасть змогу порахувати як сам час спрацовавання реле так і час повного перемикання між крайніми контактами реле та порівняти його

при надсиланні команди в термінал, ми вмикаємо подаємо сигнал на реле і паралельно починаємо ззаміряти час

1 - час між центральною 1 та появи його на лівому контакту
2 - час між центральною 1 та появи його на правому контакту
3 - час між зникненням 1 з однієї сторони та появи його на інщій
*/

#include <Arduino.h>


void setup() {
  
}

void loop() {
  
}
