//*********************************************************************************************************
//*********************************************************************************************************
//*********************************************************************************************************


/*

Проект домашнього завдання ->
1 - три світлодіода, яскравість який контролюється за допомогою ШІМ
2 - сквадність ШІМ регулюємо за допомогою потенціометра
3 - кнопка для перемикання між світлодіолами (по колу)
4 - вбудований світлодіод що блікає відповідно від того який стітлодіод вибрано
        - один швидкий блік - перший світлодіод
        - два швидких бліка - другий світлодіод
        - три щвидких бліки - третій ствітлодіод
  *
  5 - живлення світлодіодів згладити конденсатором
  6 - чоерез АЦП заміряти напругу на кожному світлодіоді 

*/


//*********************************************************************************************************
#include <Arduino.h>

// Clear project from new lessons created on bace platform in arduino

// put function declarations here:
int myFunction(int, int);

void setup() {
  // put your setup code here, to run once:
  int result = myFunction(2, 3);
}

void loop() {
  // put your main code here, to run repeatedly:
}

// put function definitions here:
int myFunction(int x, int y) {
  return x + y;
}